scribbl/app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "text", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "new"], ["text", "post"], ["created_at", "2015-11-11 13:42:16.015659"], ["updated_at", "2015-11-11 13:42:16.015659"]]
---
  def create
    @post = Post.new(post_params)

    if @post.save