app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "First Blog"], ["text", "Test it!!\r\n"], ["created_at", "2015-11-10 19:32:00.990774"], ["updated_at", "2015-11-10 19:32:00.990774"]]
---
  def create
    @article = Article.new(article_params)

    if @article.save #