app/controllers/comments_controller.rb

  def create
    @article = Article.find(params[:post_id])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]

  def destroy
    @article = Article.find(params[:post_id])
    @comment = Comment.find(params[:id])
    @comment.destroy
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 5]]