app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", nil]]
INSERT INTO "comments" ("commenter", "body", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter", "alex"], ["body", "does it work\r\n"], ["article_id", 1], ["created_at", "2015-11-10 23:51:29.169212"], ["updated_at", "2015-11-10 23:51:29.169212"]]
---
  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create!(comment_params)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 16]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @post = Post.find(params[:post_id])
    @comment = Comment.find(params[:id])