app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "text", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "yolo "], ["text", "swag"], ["created_at", "2015-11-11 04:12:04.195997"], ["updated_at", "2015-11-11 04:12:04.195997"]]
---
  def create
    @post = current_user.posts.create!(post_params)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 6]]
UPDATE "posts" SET "text" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["text", "sraga"], ["updated_at", "2015-11-11 04:17:48.884127"], ["id", 6]]
---
  def update
    @post = Post.find(params[:id])
      @post.update(post_params)